# CreateFreeForm Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Rebar..::..CreateFreeForm Method
Rebar Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateFreeForm(Document, Guid, RebarBarType, Element) | Creates a free form rebar that can have constraints. |
| CreateFreeForm(Document, RebarBarType, Element, IList<(Of <<'(CurveLoop>)>>), RebarFreeFormValidationResult%) | Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar. |
| CreateFreeForm(Document, RebarBarType, Element, IList<(Of <<'(IList<(Of <<'(Curve>)>>)>)>>), RebarFreeFormValidationResult%) | Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar. |

# See Also
Rebar Class
Rebar Members
Autodesk.Revit.DB.Structure Namespace